create database if not exists burger default character set utf8mb4;

use burger;

CREATE TABLE if not exists menu (
	category VARCHAR(20),
    id INT auto_increment primary key,
    name VARCHAR(100),
    price INT,
	stock INT
);

INSERT INTO menu (category, name, price, stock) VALUES
-- 와퍼
('와퍼', '와퍼', 7200, 50),
('와퍼', '치즈와퍼', 7500, 50),
('와퍼', '갈릭불고기와퍼', 7400, 50),
('와퍼', '베이컨치즈와퍼', 8900, 50),
('와퍼', '블랙바비큐와퍼', 9300, 50),
('와퍼', '몬스터와퍼', 9300, 50),
('와퍼', '통새우와퍼', 7900, 50),
('와퍼', '와퍼주니어', 4800, 50),

-- 버거
('버거', '치킨킹', 7400, 50),
('버거', '치킨킹BLT', 8500, 50),
('버거', '슈림프버거', 5900, 50),
('버거', '통새우 슈림프버거', 6900, 50),
('버거', '비프&슈림프버거', 7900, 50),
('버거', '롱치킨버거', 5600, 50),
('버거', '불맛 더블치즈버거', 9500, 50),

-- 사이드
('사이드', '프렌치프라이(R)', 2100, 30),
('사이드', '프렌치프라이(L)', 2600, 30),
('사이드', '리얼 어니언링(R)', 2600, 30),
('사이드', '리얼 어니언링(L)', 4000, 30),
('사이드', '너겟킹 4조각', 2200, 30),
('사이드', '쉐이킹프라이', 2400, 30),

-- 음료
('음료', '콜라 / 사이다 (R)', 2000, 100),
('음료', '아메리카노', 1500, 50);

